"""
Задание 4.

Для этой задачи:
1) придумайте 2-3 решения (обязательно с различной сложностью)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.

Примечание: ПРОШУ ВАС ВНИМАТЕЛЬНО ЧИТАТЬ ЗАДАНИЕ!
"""
import random
import time


class Authentication:

    def __init__(self, login, password, active=False):
        self.login = login
        self.password = password
        self.active = active

    def access(self):
        if self.active is True:     # O(1)
            print("Доступ разрешен!!!")     # O(1)
        else:
            choice = input(
                "Ваша учетная запись не активирована, для доступа к ресурсу необходимо активировать учетную запись, "
                "желаете произвести активацию? (Да/Нет)")   # O(1)
            if choice == 'Да':  # O(1)
                if self.active is False:    # O(1)
                    print("Для активации введите код который придет вам в смс сообщении...")    # O(1)
                    code = round(random.random() * 10000)
                    sec = 3     # O(1)

                    while sec != 0:     # O(N)
                        print(sec, '...')   # O(1)
                        time.sleep(1)
                        sec -= 1

                    print(f"Код для активации учетной записи: {code}")
                    code_rev = int(input())

                    while code_rev != code:     # O(N)
                        print("Не верный код, проверьте правильность введенных данных")
                    self.active = True
                    print("Учетная запись активирована!!!\nДоступ разрешен!!!")
                else:
                    print("Ваша учетная запись уже активирована!")
            else:
                print("В другой раз)")
# Сложность: O(N)


profile1 = Authentication("Bruno133", "Qwerty65")
profile1.access()
