"""
Задание 4.
Реализуйте скрипт "Кэширование веб-страниц"

Функция должна принимать url-адрес и проверять
есть ли в кэше соответствующая страница или нет.

Пример кэша: {'url-адрес': 'хеш url-а'; 'url-адрес': 'хеш url-а'; ...}

Если страница в кэше есть, просто вернуть значение хеша, например, 'хеш url-а'
Если страницы в кэше нет, то вычислить хеш и записать в кэш

Подсказка: задачу решите обязательно с применением 'соленого' хеширования
и одного из алгоритмов, например, sha512
Можете усложнить задачу, реализовав ее через ООП
"""


import hashlib
from uuid import uuid4


salt = uuid4().hex
cache = {}


def get_page(url):
    if cache.get(url):
        print(f"Данный сайт: {url} имеется в кэше")
    else:
        hash_url = hashlib.sha256(salt.encode() + url.encode()).hexdigest()
        cache[url] = hash_url
        print(f"Данного сайта: {url} не было в кэше")


get_page('www.gb.ru')
get_page('www.gb.ru')
get_page('www.vk.com')
