"""
Задание 4.	Найти сумму n элементов следующего ряда чисел:
1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Нужно обойтисть без создания массива!
"""


def summa(n: int, result=0, value=1.0):
    if n != 0:
        result += value
        value = value / -2
        n -= 1
        return summa(n, result=result, value=value)
    else:
        return result


print(summa(3))
