"""
Задание 2.

Попытайтесь выполнить профилирование памяти в любом скрипте с рекурсией.

Вам нужно обнаружить проблему в процессе этого. Но проблема связана не с тем,
что рекурсия потребляет много памяти, а с самим процессом замеров.

Опищите эту проблему и найдите простой путь ее решения.
Опишите этот путь и покажите его применение.
"""
from sys import getsizeof


def summa(n: int, result=0, value=1.0):
    if n != 0:
        result += value
        value = value / -2
        n -= 1
        return summa(n, result=result, value=value)
    else:
        return result


print(getsizeof(summa(198)))
